khose-ie/smac-stm32/source/smac-stm32-pwm.c
#include <smac-mcu.h>
#include <smac-stm32.h>
#include <stm32.h>

/// @brief Create a PWM instance within the MCU abstraction layer.
/// @details This function creates a PWM instance within the MCU abstraction layer, associating it
/// with the provided handle and channel.
smacPwm_t smac_pwm_create(void* handle)
{
    return (smacPwm_t)stm32_device_queue_allocate(handle);
}

/// @brief Drop a PWM instance within the MCU abstraction layer.
/// @details This function releases the resources associated with the specified PWM instance.
void smac_pwm_drop(smacPwm_t pwm)
{
    stm32_device_queue_free((stm32Device_t*)pwm);
    stm32_device_event_queue_free((stm32Device_t*)pwm);
}

/// @brief Set PWM event callbacks for the specified PWM instance.
smacRetCode_t smac_pwm_set_event(smacPwm_t pwm, smacPwmEvent_t* event, smacMcuEventData_t data)
{
    return stm32_device_event_queue_allocate((stm32Device_t*)pwm, (stm32DeviceEventHandle_t*)event,
                                             data);
}

/// @brief Clean PWM event callbacks for the specified PWM instance.
void smac_pwm_clean_event(smacPwm_t pwm)
{
    stm32_device_event_queue_free((stm32Device_t*)pwm);
}

/// @brief Activate the specified PWM instance.
/// @details This function activates the PWM signal generation for the specified PWM instance.
smacRetCode_t smac_pwm_activate(smacPwm_t pwm, uint32_t channel)
{
    stm32Device_t* device = (stm32Device_t*)pwm;
    return (device != NULL) && (device->handle != NULL)
               ? stm32_cast_code(HAL_TIM_PWM_Start(device->handle, channel))
               : SMAC_RET_NULL_REF;
}

/// @brief Deactivate the specified PWM instance.
/// @details This function stops the PWM signal generation for the specified PWM instance.
smacRetCode_t smac_pwm_deactivate(smacPwm_t pwm, uint32_t channel)
{
    stm32Device_t* device = (stm32Device_t*)pwm;
    return (device != NULL) && (device->handle != NULL)
               ? stm32_cast_code(HAL_TIM_PWM_Stop(device->handle, channel))
               : SMAC_RET_NULL_REF;
}

/// @brief Asynchronously activate the specified PWM instance.
/// @details This function initiates an asynchronous activation of the PWM signal generation for the
/// specified PWM instance.
smacRetCode_t smac_pwm_async_activate(smacPwm_t pwm, uint32_t channel)
{
    stm32Device_t* device = (stm32Device_t*)pwm;
    return (device != NULL) && (device->handle != NULL)
               ? stm32_cast_code(HAL_TIM_PWM_Start_IT(device->handle, channel))
               : SMAC_RET_NULL_REF;
}

/// @brief Asynchronously deactivate the specified PWM instance.
/// @details This function initiates an asynchronous deactivation of the PWM signal generation for
/// the specified PWM instance.
smacRetCode_t smac_pwm_async_deactivate(smacPwm_t pwm, uint32_t channel)
{
    stm32Device_t* device = (stm32Device_t*)pwm;
    return (device != NULL) && (device->handle != NULL)
               ? stm32_cast_code(HAL_TIM_PWM_Stop_IT(device->handle, channel))
               : SMAC_RET_NULL_REF;
}

/// @brief Asynchronously activate the specified PWM instance with the provided data.
/// @details This function initiates an asynchronous activation of the PWM signal generation for the
/// specified PWM instance using the provided data.
smacRetCode_t smac_pwm_async_activate_data(smacPwm_t pwm, uint32_t channel, const uint32_t* data,
                                           uint16_t size)
{
    stm32Device_t* device = (stm32Device_t*)pwm;
    return (device != NULL) && (device->handle != NULL)
               ? stm32_cast_code(HAL_TIM_PWM_Start_DMA(device->handle, channel, data, size))
               : SMAC_RET_NULL_REF;
}

/// @brief Asynchronously deactivate the specified PWM instance with the provided data.
/// @details This function initiates an asynchronous deactivation of the PWM signal generation for
/// the specified PWM instance using the provided data.
smacRetCode_t smac_pwm_async_deactivate_data(smacPwm_t pwm, uint32_t channel)
{
    stm32Device_t* device = (stm32Device_t*)pwm;
    return (device != NULL) && (device->handle != NULL)
               ? stm32_cast_code(HAL_TIM_PWM_Stop_DMA(device->handle, channel))
               : SMAC_RET_NULL_REF;
}

/// ===============================================================================================
/// @name PWM Callback Implementations
/// @brief Implementation of PWM callback functions for handling various PWM events.
/// ===============================================================================================

void HAL_TIM_PWM_PulseFinishedCallback(TIM_HandleTypeDef* htim)
{
    stm32DeviceEvent_t* event = stm32_device_event_queue_search((stm32DeviceHandle_t)htim);

    if ((event != NULL) && (event->event != NULL) && (event->event->pwm.pulse_complete != NULL))
    {
        event->event->pwm.pulse_complete(event->device, htim->Channel, event->event_data);
    }
}

// void HAL_TIM_PWM_PulseFinishedHalfCpltCallback(TIM_HandleTypeDef* htim) {}
